--=============================================================
--1.变量
--全局变量
PROJECT = "Luat_OS"--
VERSION = "1.0.0" --
--局部变量
local name="合宙"
--=============================================================
--2.关键字
_G.sys = require("sys")
--=============================================================
--3.打印
print(PROJECT,VERSION)
log.info(PROJECT,VERSION)
--=============================================================
--4.注释
--print(PROJECT,VERSION)
--log.info(PROJECT,VERSION)
--print(PROJECT,VERSION)
--log.info(PROJECT,VERSION)
--=============================================================
--6.字符串
local name1="我是"
local name_all=name1..name..PROJECT
log.info(name_all)
--=============================================================
--7.条件判断
n = 5
if n < 10 then
    log.info('n小于10')
end
--=============================================================
--8.循环
local result = 0
local num = 1
while num <= 10 do
    result = result + num
    num = num + 1
end
log.info(result)
--=============================================================
--9.函数
function hello()
    log.info('你好,LuatOS')
end
hello()--执行这个函数
--=============================================================
--10.数组
t = {"我","今年",40,"岁"}
log.info(t[1]) --打印数组里面第一个东西
log.info(t[2]) --打印数组里面第二个东西
log.info(t[3]) --打印数组里面第三个东西
log.info(t[4]) --打印数组里面第四个东西
--=============================================================
--5.程序结束
--我们的代码已结束
sys.run()-- 结尾总是这一句
--=============================================================

