-- LuaTools需要PROJECT和VERSION这两个信息
PROJECT = "stringtest"
VERSION = "2.0.0"
-- sys库是标配
_G.sys = require("sys")

sys.taskInit(function ()
    sys.wait(1000) -- 免得看不到日志
    --================================================
    -- 字符串的声明和生成
    local str="LuatOS" 
    log.info("字符串str=",str)
    --================================================
    --================================================
    -- 转义字符
    log.info("字符串回车换行,但不显示回车换行的字符")
    local str = "LuatOS\n\r" 
    log.info("带不显示字符的字符串str=",str)
    --================================================
    --================================================
    -- 字符串的拼接
    local str = "LuatOS" 
    local str1 = "你好，" 
    log.info("字符串str=",str,"字符串str1=",str1)
    local str2=str1..str
    log.info("拼接的字符串str2=",str2)
    --================================================
    --================================================
    -- 数字转字符串
    local n= 13
    local str1 = "你好" 
    log.info("数字n=",n,"字符串str1=",str1)
    local str2=tostring(n)..str1
    log.info("拼接的字符串str2=",str2)
    --================================================
    --================================================
    -- 字符串转数字
    local n= 12
    local str1 = "13"
    log.info("数字n=", n,"字符串str1=",str1)
    local n1=tonumber(str1)+n
    log.info("数字12+字符串“13”=",n1)
    --================================================
    --================================================
    -- 字符串转十六进制
    local hex = string.toHex("LuatOS")
    -- 获取字符串的HEX字符串显示
    log.info("LuatOS字符串转十六进制", hex)
    -- 获取指定位置的值, 注意lua的下标是1开始的
    --================================================
    --================================================
    -- 十六进制转字符串
    local str = string.fromHex("4C7561744F53")
    log.info("十六进制转字符串str=",str)
    --================================================
    -- 合成式,组合十六进制数
    local str = string.char(0x01, 0x00, 0xF1, 0x3A)
    local hex = string.toHex(str)
    log.info("组合十六进制数=",hex) 
    --================================================
    -- 获取指定位置的值, 注意lua的下标是1开始的
    local str = "LuatOS"
    log.info("第一个字符是str[1]", string.byte(str, 1))
    log.info("第四个字符是str[4]", string.byte(str, 4))
    --================================================
end)

-- 用户代码已结束---------------------------------------------
-- 结尾总是这一句
sys.run()
-- sys.run()之后后面不要加任何语句!!!!!
